Revit 2026 API

# ElementGetExternalResourceReferences Method

---

Gets the map of the external resource references referenced by the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IDictionary<ExternalResourceType, ExternalResourceReference> GetExternalResourceReferences()
```
```vb
Public Function GetExternalResourceReferences As IDictionary(Of ExternalResourceType, ExternalResourceReference)
```
```cpp
public:
IDictionary<ExternalResourceType^, ExternalResourceReference^>^ GetExternalResourceReferences()
```
```fsharp
member GetExternalResourceReferences : unit -> IDictionary<ExternalResourceType, ExternalResourceReference>
```

#### Return Value

IDictionaryExternalResourceType, ExternalResourceReference The map of the external resource references referenced by the element.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This Element does not use any external resource. |

For an element which has multiple external resource references under a specified type like AppearanceAssetElement, the first one will be the value in the map. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReferencesExpanded].

#### Reference

Element Class

Autodesk.Revit.DB Namespace